In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
s1 =Series([1,2,3],index=["A","B","C"])
s1

A    1
B    2
C    3
dtype: int64

In [5]:
s2 = Series([4,np.nan,6,7],index=["B","C","D","E"])
s2

B    4.0
C    NaN
D    6.0
E    7.0
dtype: float64

In [6]:
s1+s2

A    NaN
B    6.0
C    NaN
D    NaN
E    NaN
dtype: float64

# DataFrame 运算

In [5]:
df1 = DataFrame(np.arange(4).reshape(2,2),index = ["A","B"],columns = ["bj","sh"])
df1

   bj  sh
A   0   1
B   2   3

In [6]:
df2 = DataFrame(np.arange(9).reshape(3,3),index = ["A","B","C"],columns = ["bj","sh","gz"])
df2

   bj  sh  gz
A   0   1   2
B   3   4   5
C   6   7   8

In [7]:
df1+df2

    bj  gz   sh
A  0.0 NaN  2.0
B  5.0 NaN  7.0
C  NaN NaN  NaN

In [9]:
df3 = DataFrame([[1,2,3],[4,5,np.nan],[7,8,9]],index = ["A","B","C"],columns=["c1","c2","c3"])
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0

In [10]:
print(type(df3.sum()))  # nan 被看作是没有，忽略  sum（）是列求和
df3.sum()

<class 'pandas.core.series.Series'>

c1    12.0
c2    15.0
c3    12.0
dtype: float64

In [11]:
df3.sum(axis=1)  # 行求和

A     6.0
B     9.0
C    24.0
dtype: float64

In [12]:
df3.min()  # 列求小

c1    1.0
c2    2.0
c3    3.0
dtype: float64

In [13]:
df3.max(axis=1)  # 行求大

A    3.0
B    5.0
C    9.0
dtype: float64

In [18]:
df3.describe()

        c1   c2        c3
count  3.0  3.0  2.000000
mean   4.0  5.0  6.000000
std    3.0  3.0  4.242641
min    1.0  2.0  3.000000
25%    2.5  3.5  4.500000
50%    4.0  5.0  6.000000
75%    5.5  6.5  7.500000
max    7.0  8.0  9.000000

In [19]:
df3

   c1  c2   c3
A   1   2  3.0
B   4   5  NaN
C   7   8  9.0